#!/usr/bin/env bash

# 如果你安装manjaro时的系统字体是中文，可以注释掉下面一部分
# echo "==========================================================================================================================================================="
# echo "[SCRIPT] 正在将目录更换为英文..."
# sudo pacman -S xdg-user-dirs-gtk
# export LANG=en_US
# xdg-user-dirs-gtk-update
# export LANG=zh_CN.UTF-8

echo "==========================================================================================================================================================="
echo "[SCRIPT] 正在安装包管理器, yay..."
yes " " | sudo pacman -S yay


echo "==========================================================================================================================================================="
echo "[SCRIPT] 正在安装蓝牙相关, bluez, bluez-utils..."
yes " " | yay -S bluez, bluez-utils
echo "[SCRIPT] 请确认开启蓝牙相关服务..."
systemctl start bluetooth.service
